#!/usr/bin/python
# -*- coding: utf-8 -*-
"""
################################################################################
###
###     Programme : Liaison série RS232 avec code correcteur d'erreur
###
###     Description : Implémentation d'un code correcteur d'erreur pour une
###                   liaison série capable de corriger deux erreurs par octets
###
###     Notes : ///////
###
###     Auteurs : Toladar
###               gregdub
###
###     Date : 23/02/17
###
################################################################################
"""

LIST_CODE = ["000", "100", "001", "101", "010", "110", "011", "111"]

LIST_DECODE = ["00000000000000000000",# 000
               "01111011110100000000",# 100
               "00000000011110111101",# 001
               "01111011101010111101",# 101
               "00000111101111010000",# 010
               "01111100011011010000",# 110
               "00000111110001101101",# 011
               "01111100000101101101"]# 111
